ХМНПФ_Общее/Documents/пдс_ПоступлениеВзносовПДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>пдс_ПоступлениеВзносовПДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСписков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_НачислениеРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачислениеРезервов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/пдс_ПоступлениеВзносовПДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТЧПоДокументуОснованию")
Процедура ХМЗаполнитьТЧПоДокументуОснованию()
	Если Объект.ЭтоНераспределенныйПлатеж Тогда
		Возврат;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	//если к поступлению привязано начисление резервов, то заполняем по нему
	//если нет, то по расшифровке платежа 
	//ищем начисление резрвов 
	Объект.СписокСчетов.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_НачислениеРезервовПлВходящие.Ссылка,
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование,
	|	СУММА(уп_НачислениеРезервовПлВходящие.СуммаВзноса) КАК СуммаВзноса
	|ИЗ
	|	Документ.уп_НачислениеРезервов.ДокументыОснования КАК уп_НачислениеРезервовПлВходящие
	|ГДЕ
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование = &ПлПоручениеВходящее
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_НачислениеРезервовПлВходящие.Ссылка,
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование";

	Запрос.УстановитьПараметр("ПлПоручениеВходящее", Объект.ДокументОснование);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		НачислениеРезервов = Выборка.Ссылка;
		Для Каждого стр из НачислениеРезервов.ДокументыОснования Цикл
			ДоговорКонтрагента = стр.ДоговорКонтрагента;
			ДоговорПДС = ДоговорКонтрагента.уп_Договор;
#Вставка
			//ЛыткинАМ //24.01.2025 //https://redmine.npf.com/issues/4024
			Если Не ТипЗнч(ДоговорПДС) = Тип("СправочникСсылка.пдс_ДоговорыПДС") Тогда
				ДоговорПДС = Неопределено;
			КонецЕсли;
#КонецВставки
			Если ЗначениеЗаполнено(ДоговорПДС) Тогда  
				Если ДоговорПДС.ТипДоговора = Перечисления.пдс_ТипыДоговоровПДС.ВПользуТретьихЛиц Тогда
					СписокПС = ПолучитьПСПоДоговору(ДоговорПДС); 
					Если СписокПС.Количество()>0 Тогда
						СуммаНаПС = стр.СуммаВзноса/СписокПС.Количество();
						Для а = 0 по СписокПС.Количество()-1 Цикл 
							ПС = СписокПС.Получить(а);
							НовСтр = Объект.СписокСчетов.Добавить();
							НовСтр.НомерСчета = ПС;
							НовСтр.СуммаВзноса = СуммаНаПС; 
						КонецЦикла;
					Иначе
						НовСтр = Объект.СписокСчетов.Добавить();
						НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
						НовСтр.СуммаВзноса = стр.СуммаВзноса; 
					КонецЕсли; 
				Иначе 
					НовСтр = Объект.СписокСчетов.Добавить();
					НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
					НовСтр.СуммаВзноса = стр.СуммаВзноса; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Платежка = Объект.ДокументОснование;
		Для Каждого стр из Платежка.РасшифровкаПлатежа Цикл
			ДоговорКонтрагента = стр.ДоговорКонтрагента;
			ДоговорПДС = ДоговорКонтрагента.уп_Договор;
#Вставка
			//ЛыткинАМ //24.01.2025 //https://redmine.npf.com/issues/4024
			Если Не ТипЗнч(ДоговорПДС) = Тип("СправочникСсылка.пдс_ДоговорыПДС") Тогда
				ДоговорПДС = Неопределено;
			КонецЕсли;
#КонецВставки
			Если ЗначениеЗаполнено(ДоговорПДС) Тогда  
				Если ДоговорПДС.ТипДоговора = Перечисления.пдс_ТипыДоговоровПДС.ВПользуТретьихЛиц Тогда
					СписокПС = ПолучитьПСПоДоговору(ДоговорПДС); 
					Если СписокПС.Количество()>0 Тогда
						СуммаНаПС = стр.СуммаПлатежа/СписокПС.Количество();
						Для а = 0 по СписокПС.Количество()-1 Цикл 
							ПС = СписокПС.Получить(а);
							НовСтр = Объект.СписокСчетов.Добавить();
							НовСтр.НомерСчета = ПС;
							НовСтр.СуммаВзноса = СуммаНаПС; 
						КонецЦикла;
					Иначе
						НовСтр = Объект.СписокСчетов.Добавить();
						НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
						НовСтр.СуммаВзноса = стр.СуммаПлатежа; 
					КонецЕсли; 
				Иначе 
					НовСтр = Объект.СписокСчетов.Добавить();
					НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
					НовСтр.СуммаВзноса = стр.СуммаПлатежа; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
